package com.nakanara.openapi1;

import com.google.gson.Gson;
import com.google.gson.reflect.TypeToken;
import org.slf4j.Logger;
import org.slf4j.LoggerFactory;

import java.util.List;
import java.util.Map;
import java.util.Set;

/**
 * Created by steg on 2017-06-22.
 */
public class Test {

    public static void main(String args[]) {

        String jsonData = "{\"response\":{\"header\":{\"resultCode\":\"00\",\"resultMsg\":\"NORMAL SERVICE.\"},\"body\":{\"items\":{\"item\":[{\"거래금액\":\"   105,000\",\"건축년도\":2008,\"년\":2017,\"도로명\":\"사직로8길\",\"도로명건물본번호코드\":\"00004\",\"도로명건물부번호코드\":\"00000\",\"도로명시군구코드\":11110,\"도로명일련번호코드\":\"03\",\"도로명지상지하코드\":0,\"도로명코드\":4100135,\"법정동\":\"사직동\",\"법정동본번코드\":\"0009\",\"법정동부번코드\":\"0000\",\"법정동시군구코드\":11110,\"법정동읍면동코드\":11500,\"법정동지번코드\":1,\"아파트\":\"광화문풍림스페이스본(9-0)\",\"월\":6,\"일\":\"11~20\",\"일련번호\":\"11110-2203\",\"전용면적\":146.92,\"지번\":9,\"지역코드\":11110,\"층\":6},{\"거래금액\":\"   165,000\",\"건축년도\":2004,\"년\":2017,\"도로명\":\"사직로8길\",\"도로명건물본번호코드\":\"00034\",\"도로명건물부번호코드\":\"00000\",\"도로명시군구코드\":11110,\"도로명일련번호코드\":\"05\",\"도로명지상지하코드\":0,\"도로명코드\":4100135,\"법정동\":\"내수동\",\"법정동본번코드\":\"0072\",\"법정동부번코드\":\"0000\",\"법정동시군구코드\":11110,\"법정동읍면동코드\":11800,\"법정동지번코드\":1,\"아파트\":\"경희궁의아침3단지\",\"월\":6,\"일\":\"11~20\",\"일련번호\":\"11110-116\",\"전용면적\":174.55,\"지번\":72,\"지역코드\":11110,\"층\":13},{\"거래금액\":\"    54,500\",\"건축년도\":2006,\"년\":2017,\"도로명\":\"종로\",\"도로명건물본번호코드\":\"00183\",\"도로명건물부번호코드\":\"00000\",\"도로명시군구코드\":11110,\"도로명일련번호코드\":\"09\",\"도로명지상지하코드\":0,\"도로명코드\":3100013,\"법정동\":\"인의동\",\"법정동본번코드\":\"0048\",\"법정동부번코드\":\"0002\",\"법정동시군구코드\":11110,\"법정동읍면동코드\":15700,\"법정동지번코드\":1,\"아파트\":\"효성쥬얼리시티\",\"월\":6,\"일\":\"1~10\",\"일련번호\":\"11110-2155\",\"전용면적\":98.39,\"지번\":\"48-2\",\"지역코드\":11110,\"층\":7},{\"거래금액\":\"    65,500\",\"건축년도\":2006,\"년\":2017,\"도로명\":\"종로\",\"도로명건물본번호코드\":\"00183\",\"도로명건물부번호코드\":\"00000\",\"도로명시군구코드\":11110,\"도로명일련번호코드\":\"09\",\"도로명지상지하코드\":0,\"도로명코드\":3100013,\"법정동\":\"인의동\",\"법정동본번코드\":\"0048\",\"법정동부번코드\":\"0002\",\"법정동시군구코드\":11110,\"법정동읍면동코드\":15700,\"법정동지번코드\":1,\"아파트\":\"효성쥬얼리시티\",\"월\":6,\"일\":\"1~10\",\"일련번호\":\"11110-2155\",\"전용면적\":106.81,\"지번\":\"48-2\",\"지역코드\":11110,\"층\":16},{\"거래금액\":\"    33,200\",\"건축년도\":1993,\"년\":2017,\"도로명\":\"낙산길\",\"도로명건물본번호코드\":\"00198\",\"도로명건물부번호코드\":\"00000\",\"도로명시군구코드\":11110,\"도로명일련번호코드\":\"02\",\"도로명지상지하코드\":0,\"도로명코드\":4100020,\"법정동\":\"창신동\",\"법정동본번코드\":\"0703\",\"법정동부번코드\":\"0000\",\"법정동시군구코드\":11110,\"법정동읍면동코드\":17400,\"법정동지번코드\":1,\"아파트\":\"창신쌍용2\",\"월\":6,\"일\":\"1~10\",\"일련번호\":\"11110-91\",\"전용면적\":64.66,\"지번\":703,\"지역코드\":11110,\"층\":5},{\"거래금액\":\"    38,500\",\"건축년도\":1993,\"년\":2017,\"도로명\":\"낙산길\",\"도로명건물본번호코드\":\"00198\",\"도로명건물부번호코드\":\"00000\",\"도로명시군구코드\":11110,\"도로명일련번호코드\":\"02\",\"도로명지상지하코드\":0,\"도로명코드\":4100020,\"법정동\":\"창신동\",\"법정동본번코드\":\"0703\",\"법정동부번코드\":\"0000\",\"법정동시군구코드\":11110,\"법정동읍면동코드\":17400,\"법정동지번코드\":1,\"아파트\":\"창신쌍용2\",\"월\":6,\"일\":\"1~10\",\"일련번호\":\"11110-91\",\"전용면적\":79.87,\"지번\":703,\"지역코드\":11110,\"층\":8},{\"거래금액\":\"    40,000\",\"건축년도\":1993,\"년\":2017,\"도로명\":\"낙산길\",\"도로명건물본번호코드\":\"00198\",\"도로명건물부번호코드\":\"00000\",\"도로명시군구코드\":11110,\"도로명일련번호코드\":\"02\",\"도로명지상지하코드\":0,\"도로명코드\":4100020,\"법정동\":\"창신동\",\"법정동본번코드\":\"0703\",\"법정동부번코드\":\"0000\",\"법정동시군구코드\":11110,\"법정동읍면동코드\":17400,\"법정동지번코드\":1,\"아파트\":\"창신쌍용2\",\"월\":6,\"일\":\"1~10\",\"일련번호\":\"11110-91\",\"전용면적\":79.87,\"지번\":703,\"지역코드\":11110,\"층\":3},{\"거래금액\":\"    34,500\",\"건축년도\":1992,\"년\":2017,\"도로명\":\"동망산길\",\"도로명건물본번호코드\":\"00019\",\"도로명건물부번호코드\":\"00000\",\"도로명시군구코드\":11110,\"도로명일련번호코드\":\"01\",\"도로명지상지하코드\":0,\"도로명코드\":4100065,\"법정동\":\"창신동\",\"법정동본번코드\":\"0702\",\"법정동부번코드\":\"0000\",\"법정동시군구코드\":11110,\"법정동읍면동코드\":17400,\"법정동지번코드\":1,\"아파트\":\"창신쌍용1\",\"월\":6,\"일\":\"11~20\",\"일련번호\":\"11110-37\",\"전용면적\":54.7,\"지번\":702,\"지역코드\":11110,\"층\":14},{\"거래금액\":\"    14,300\",\"건축년도\":2013,\"년\":2017,\"도로명\":\"종로66길\",\"도로명건물본번호코드\":\"00028\",\"도로명건물부번호코드\":\"00000\",\"도로명시군구코드\":11110,\"도로명일련번호코드\":\"01\",\"도로명지상지하코드\":0,\"도로명코드\":4100372,\"법정동\":\"숭인동\",\"법정동본번코드\":\"0202\",\"법정동부번코드\":\"0003\",\"법정동시군구코드\":11110,\"법정동읍면동코드\":17500,\"법정동지번코드\":1,\"아파트\":\"종로중흥S클래스\",\"월\":6,\"일\":\"1~10\",\"일련번호\":\"11110-2339\",\"전용면적\":19.47,\"지번\":\"202-3\",\"지역코드\":11110,\"층\":10},{\"거래금액\":\"    49,700\",\"건축년도\":2009,\"년\":2017,\"도로명\":\"숭인동길\",\"도로명건물본번호코드\":\"00021\",\"도로명건물부번호코드\":\"00000\",\"도로명시군구코드\":11110,\"도로명일련번호코드\":\"01\",\"도로명지상지하코드\":0,\"도로명코드\":4100204,\"법정동\":\"숭인동\",\"법정동본번코드\":\"0766\",\"법정동부번코드\":\"0000\",\"법정동시군구코드\":11110,\"법정동읍면동코드\":17500,\"법정동지번코드\":1,\"아파트\":\"종로청계힐스테이트\",\"월\":6,\"일\":\"1~10\",\"일련번호\":\"11110-2234\",\"전용면적\":59.94,\"지번\":766,\"지역코드\":11110,\"층\":13}]},\"numOfRows\":10,\"pageNo\":1,\"totalCount\":17}}}";


        Gson gson = new Gson();
        Map<String, Object> jsonObject = gson.fromJson(jsonData, new TypeToken<Map<String, Object>>(){}.getType());

        Logger logger = LoggerFactory.getLogger("main");

        logger.info("size = {} Data = {}", jsonObject.size(), jsonObject);

        Map<String, Object> response = (Map) jsonObject.get("response");

        logger.info("response size = {} Data = {}", response.size(), response);

        Map<String, Object> body = (Map) response.get("body");

        logger.info("body items = {} Data = {}", body.size(), body);

        Map<String, Object> items = (Map) body.get("items");

        logger.info("items items = {} Data = {}", items.size(), items);

        List<Map<String, Object>> item = (List) items.get("item");

        logger.info("item items = {} Data = {}", item.size(), item);

        for ( Map<String, Object> m : item) {

            logger.info("item 거래 금액: {} 건축년도: {} //{}", m.get("거래금액"), m.get("건축년도"), m);

        }


    }
}
