package com.nakanara.openapi1.apt.dao;

import java.util.Map;

/**
 * Created by steg on 2017-06-22.
 */
public class RTMSDao {


    private long bullingYY; // 건축년도
    private long dealMoney; // 거래 금액
    private long dealYY;    // 거래 년
    private long dealMM;   // 거래 월
    private String dealDD;  // 거래 주.
    private String loadName;    // 도로 명
    private long loadMainNum; // 도로명건물본번호코드
    private long loadSubNum;    // 도로명건물부번호코드
    private long loadNum;   // 도로명일련번호코드
    private long loadCode;  // 도로명코드
    private String areaName;    // 법정동
    private long areaNameCode;    // 법정동본번코드
    private long areaNameSubCode;    // 법정동부번코드
    private long localCode; // 지역코드
    private String name;    // 상호
    private long floor;     // 층.


    public RTMSDao() {

    }

    public RTMSDao(Map<String, Object> m) {
        //거래금액=   105,000,

        // 건축년도=2008.0,
        // 년=2017.0,
        // 도로명=사직로8길,
        // 도로명건물본번호코드=00004,
        // 도로명건물부번호코드=00000,
        // 도로명시군구코드=11110.0,
        // 도로명일련번호코드=03, 도로명지상지하코드=0.0,
        // 도로명코드=4100135.0,
        // 법정동=사직동,
        // 법정동본번코드=0009,
        // 법정동부번코드=0000,
        // 법정동시군구코드=11110.0, 법정동읍면동코드=11500.0, 법정동지번코드=1.0,
        // 아파트=광화문풍림스페이스본(9-0), 월=6.0, 일=11~20, 일련번호=11110-2203, 전용면적=146.92, 지번=9.0, 지역코드=11110.0,
        // 층=6.0}, {거래금액=   165,000, 건축년도=2004.0, 년=2017.0, 도로명=사직로8길, 도로명건물본번호코드=00034, 도로명건물부번호코드=00000, 도로명시군구코드=11110.0, 도로명일련번호코드=05, 도로명지상지하코드=0.0, 도로명코드=4100135.0, 법정동=내수동, 법정동본번코드=0072, 법정동부번코드=0000, 법정동시군구코드=11110.0, 법정동읍면동코드=11800.0, 법정동지번코드=1.0, 아파트=경희궁의아침3단지, 월=6.0, 일=11~20, 일련번호=11110-116, 전용면적=174.55, 지번=72.0, 지역코드=11110.0, 층=13.0}, {거래금액=    54,500, 건축년도=2006.0, 년=2017.0, 도로명=종로, 도로명건물본번호코드=00183, 도로명건물부번호코드=00000, 도로명시군구코드=11110.0, 도로명일련번호코드=09, 도로명지상지하코드=0.0, 도로명코드=3100013.0, 법정동=인의동, 법정동본번코드=0048, 법정동부번코드=0002, 법정동시군구코드=11110.0, 법정동읍면동코드=15700.0, 법정동지번코드=1.0, 아파트=효성쥬얼리시티, 월=6.0, 일=1~10, 일련번호=11110-2155, 전용면적=98.39, 지번=48-2, 지역코드=11110.0, 층=7.0}, {거래금액=    65,500, 건축년도=2006.0, 년=2017.0, 도로명=종로, 도로명건물본번호코드=00183, 도로명건물부번호코드=00000, 도로명시군구코드=11110.0, 도로명일련번호코드=09, 도로명지상지하코드=0.0, 도로명코드=3100013.0, 법정동=인의동, 법정동본번코드=0048, 법정동부번코드=0002, 법정동시군구코드=11110.0, 법정동읍면동코드=15700.0, 법정동지번코드=1.0, 아파트=효성쥬얼리시티, 월=6.0, 일=1~10, 일련번호=11110-2155, 전용면적=106.81, 지번=48-2, 지역코드=11110.0, 층=16.0}, {거래금액=    33,200, 건축년도=1993.0, 년=2017.0, 도로명=낙산길, 도로명건물본번호코드=00198, 도로명건물부번호코드=00000, 도로명시군구코드=11110.0, 도로명일련번호코드=02, 도로명지상지하코드=0.0, 도로명코드=4100020.0, 법정동=창신동, 법정동본번코드=0703, 법정동부번코드=0000, 법정동시군구코드=11110.0, 법정동읍면동코드=17400.0, 법정동지번코드=1.0, 아파트=창신쌍용2, 월=6.0, 일=1~10, 일련번호=11110-91, 전용면적=64.66, 지번=703.0, 지역코드=11110.0, 층=5.0}, {거래금액=    38,500, 건축년도=1993.0, 년=2017.0, 도로명=낙산길, 도로명건물본번호코드=00198, 도로명건물부번호코드=00000, 도로명시군구코드=11110.0, 도로명일련번호코드=02, 도로명지상지하코드=0.0, 도로명코드=4100020.0, 법정동=창신동, 법정동본번코드=0703, 법정동부번코드=0000, 법정동시군구코드=11110.0, 법정동읍면동코드=17400.0, 법정동지번코드=1.0, 아파트=창신쌍용2, 월=6.0, 일=1~10, 일련번호=11110-91, 전용면적=79.87, 지번=703.0, 지역코드=11110.0, 층=8.0}, {거래금액=    40,000, 건축년도=1993.0, 년=2017.0, 도로명=낙산길, 도로명건물본번호코드=00198, 도로명건물부번호코드=00000, 도로명시군구코드=11110.0, 도로명일련번호코드=02, 도로명지상지하코드=0.0, 도로명코드=4100020.0, 법정동=창신동, 법정동본번코드=0703, 법정동부번코드=0000, 법정동시군구코드=11110.0, 법정동읍면동코드=17400.0, 법정동지번코드=1.0, 아파트=창신쌍용2, 월=6.0, 일=1~10, 일련번호=11110-91, 전용면적=79.87, 지번=703.0, 지역코드=11110.0, 층=3.0}, {거래금액=    34,500, 건축년도=1992.0, 년=2017.0, 도로명=동망산길, 도로명건물본번호코드=00019, 도로명건물부번호코드=00000, 도로명시군구코드=11110.0, 도로명일련번호코드=01, 도로명지상지하코드=0.0, 도로명코드=4100065.0, 법정동=창신동, 법정동본번코드=0702, 법정동부번코드=0000, 법정동시군구코드=11110.0, 법정동읍면동코드=17400.0, 법정동지번코드=1.0, 아파트=창신쌍용1, 월=6.0, 일=11~20, 일련번호=11110-37, 전용면적=54.7, 지번=702.0, 지역코드=11110.0, 층=14.0}, {거래금액=    14,300, 건축년도=2013.0, 년=2017.0, 도로명=종로66길, 도로명건물본번호코드=00028, 도로명건물부번호코드=00000, 도로명시군구코드=11110.0, 도로명일련번호코드=01, 도로명지상지하코드=0.0, 도로명코드=4100372.0, 법정동=숭인동, 법정동본번코드=0202, 법정동부번코드=0003, 법정동시군구코드=11110.0, 법정동읍면동코드=17500.0, 법정동지번코드=1.0, 아파트=종로중흥S클래스, 월=6.0, 일=1~10, 일련번호=11110-2339, 전용면적=19.47, 지번=202-3, 지역코드=11110.0, 층=10.0}, {거래금액=    49,700, 건축년도=2009.0, 년=2017.0, 도로명=숭인동길, 도로명건물본번호코드=00021, 도로명건물부번호코드=00000, 도로명시군구코드=11110.0, 도로명일련번호코드=01, 도로명지상지하코드=0.0, 도로명코드=4100204.0, 법정동=숭인동, 법정동본번코드=0766, 법정동부번코드=0000, 법정동시군구코드=11110.0, 법정동읍면동코드=17500.0, 법정동지번코드=1.0, 아파트=종로청계힐스테이트, 월=6.0, 일=1~10, 일련번호=11110-2234, 전용면적=59.94, 지번=766.0, 지역코드=11110.0, 층=13.0

    }

    @Override
    public String toString() {
        return "RTMSDao{" +
                "bullingYY=" + bullingYY +
                ", dealMoney=" + dealMoney +
                ", dealYY=" + dealYY +
                ", dealMM=" + dealMM +
                ", dealDD='" + dealDD + '\'' +
                ", loadName='" + loadName + '\'' +
                ", loadMainNum=" + loadMainNum +
                ", loadSubNum=" + loadSubNum +
                ", loadNum=" + loadNum +
                ", loadCode=" + loadCode +
                ", areaName='" + areaName + '\'' +
                ", areaNameCode=" + areaNameCode +
                ", areaNameSubCode=" + areaNameSubCode +
                ", localCode=" + localCode +
                ", name='" + name + '\'' +
                ", floor=" + floor +
                '}';
    }
}
